# The Problem Statement (ask by CEO)
##### Determine the states that are generating the highest revenues and###### 	Formulate sales programs for states with lower revenues. The Head of S&M has approached you for the same.
## Approach
##### Basic study of the data list the inferences
##### EDA using python
##### Create hypothesis based on sales data which will help finalize strategy
##### Hypotheisis Testing
##### Prepare a Report

##### Step 1 Read the datafile AusApparalSales4thQrt2020.csv using pandas read_csv. Validate the data has been imported successfully

In [6]:
import pandas as pd

df_sales = pd.read_csv('AusApparalSales4thQrt2020.csv')
df_sales.head()

         Date        Time State     Group  Unit  Sales
0  1-Oct-2020     Morning    WA      Kids     8  20000
1  1-Oct-2020     Morning    WA       Men     8  20000
2  1-Oct-2020     Morning    WA     Women     4  10000
3  1-Oct-2020     Morning    WA   Seniors    15  37500
4  1-Oct-2020   Afternoon    WA      Kids     3   7500

##### Step 2 Do basics Data Integrity checks

In [ ]:
print('Sales Dataset basic information')
print(df_sales.info())
print()
print('Describe the Sales Dataset')
print(df_sales.describe())
print()
print('Identify Duplicate rows')
duplicate_rows = df_sales[df_sales.duplicated(['Date','Time','State','Group' ])]
results = duplicate_rows.empty
if results:
    print('Duplicate Row with selected columns check :', 'No Duplicate Rows observed')
else:
    print(duplicate_rows)
print()
print('Identy Columns with Null data')
print(df_sales.isnull().sum())
print()
print('Identy records with any date post sales quarter ie greater thatn 30th december2020')
print('Maximum Date in dataset : ', pd.to_datetime(df_sales['Date']).max())
print('Minimum Date in dataset : ', pd.to_datetime(df_sales['Date']).min())
#missing dates slates in dataset

qtr_date_range = [pd.date_range(start='2020-10-01', end ='2020-12-31', freq='D')]

In [47]:
# sale_days =[]
# for row in df_sales.iterrows():
#     sale_days.append(df_sales['Date'])

# sale_days
# qtr_date_range

##### Step 3 : Data Wrangling

In [74]:
#Column Date 
#Convert Date column to Datetime
df_sales['Date']= pd.to_datetime(df_sales['Date'])
#Create new columns for Actual date, day,month,year,weekend yes or no) - This will help for further analytics
df_sales['Day'] = df_sales['Date'].dt.day
timestamp = pd.Timestamp(df_sales['Date'])
df_sales['Weekday'] = df_sales['Date'].dt.weekday
df_sales['WeekofYear'] = timestamp.weekofyear
df_sales['Month'] = df_sales['Date'].dt.month
df_sales['Year'] = df_sales['Date'].dt.year
# For Column Time, State and Group - Do lable encoding
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
df_sales['Time_encoded'] = label_encoder.fit_transform(df_sales['Time'])
df_sales['Sate_encoded'] = label_encoder.fit_transform(df_sales['State'])
df_sales['Group_encoded'] = label_encoder.fit_transform(df_sales['Group'])
# Add column for Avg per unit sale price
df_sales['PerUnitSaleAmt'] = df_sales['Sales'] / df_sales['Unit']
df_sales.head(5)

TypeError: Cannot convert input [0      2020-10-01
1      2020-10-01
2      2020-10-01
3      2020-10-01
4      2020-10-01
          ...
7555   2020-12-30
7556   2020-12-30
7557   2020-12-30
7558   2020-12-30
7559   2020-12-30
Name: Date, Length: 7560, dtype: datetime64[ns]] of type <class 'pandas.core.series.Series'> to Timestamp

# Exploratory Data Analysis

In [16]:
df_grouped_month = df_sales.groupby(['Month','Day','State','Group'])['Sales'].sum().reset_index()
print(df_grouped_month)
print()
#df_grouped_month = df_sales.groupby(['Month','State', 'Group'])['Sales'].sum().reset_index()

      Month  Day State     Group   Sales
0        10    1   NSW      Kids  252500
1        10    1   NSW       Men  187500
2        10    1   NSW   Seniors  202500
3        10    1   NSW     Women  235000
4        10    1    NT      Kids   97500
...     ...  ...   ...       ...     ...
2515     12   30   VIC     Women  272500
2516     12   30    WA      Kids   80000
2517     12   30    WA       Men   77500
2518     12   30    WA   Seniors   82500
2519     12   30    WA     Women  100000

[2520 rows x 5 columns]

In [59]:
df_grouped_by_group = df_sales.groupby(['Group'])['Sales'].sum().reset_index()
df_grouped_by_group

      Group     Sales
0      Kids  85072500
1       Men  85750000
2   Seniors  84037500
3     Women  85442500

In [58]:
df_grouped_by_state = df_sales.groupby(['State'])['Sales'].sum().reset_index()
df_grouped_by_state

  State      Sales
0   NSW   74970000
1    NT   22580000
2   QLD   33417500
3    SA   58857500
4   TAS   22760000
5   VIC  105565000
6    WA   22152500

In [60]:
df_grouped_by_month = df_sales.groupby(['Month'])['Sales'].sum().reset_index()
df_grouped_by_month

   Month      Sales
0     10  114290000
1     11   90682500
2     12  135330000